List<Map<String,dynamic>> sections = [
  {
    "img" : "database",
    "title" : "Database and API",
    "subTitle" : "قواعد البيانات",
    "dec" :  "بعد إنهائك لمسار التأسيس البرمجي أو كان لديك الأساس مسبقا ستتعلم تصميم وبرمجة قواعد البيانات للمواقع والتطبيقات من خلال عدة لغات أهمهاphp في بيئة التطوير Laraval",
    'levels' : [
      'قاعده البيانات',
      'تأسيس برمجي',
    ],
    "time" : "3-2 اشهر",
    "device" : "Core i3 - 4GB"
  },
  {
    "img" : "design",
    "title" : "التصميم",
    "subTitle" : "أساسيات التصميم",
    // "dec" : "بعد إلمامك بقواعد وأساسيات التصميم الجرافيكي، يُمكنك هذا المسار من تصميم واجهات مستخدم احترافية لتطبيقات الهاتف، تسمح لك بالتميز وتحقيق الريادة في سوق العمل.",
    "dec" : "هذا المسار هو الخطوة الأمثل لك في بداية رحلتـك كمصمم، مـن خلال خطة منهجية تبدأ فيها بتعلم الأسـاسيـات وتنتهي بك مصممـا محترفـا في أحـد التخصصات سواء كانت تصميم مـواقع أو تطبيقـات و تخصصات أخرى",
    'levels' : [
      '',
      'تأسيس تصميمي',
    ],
    "time" : "4-3 اشهر",
    "device" : "Core i5, i7 - 4GB"
  },
  {
    "img" : "programming",
    "title" : "البرمجة",
    "subTitle" : 'تأسيس برمجي',
    "dec" : "مع إنهاء هذا المسار ستمتلك أساسا قويا لبداية رحلتك في عالم البرمجة من خلال مسار مصمم ليبني لك منطق المبرمج الأمثل، أيا كان التخصص الذي تسعى لاحترافه هذا المسار هو البداية.",
    'levels' : [
      '',
      'تأسيس برمجي',
    ],
    "time" : "4-3 اشهر",
    "device" : "Core i3, i5 - 4GB"
  },
  {
    "img" : "montage",
    "title" : "المونتاج",
    "subTitle" : "إنتاج الفيديو و الموشن غرافيك",
    "dec" : "هذا المسار يأخذ بيدك من الصفر إلى الاحتراف فـي عالم المونتاج ، ابتداء من تعلم أساسياته وقواعـده ثم إتقان العمل على برامجه مما يمكنك من تقديم عمل إبداعي يهدف لسرد قصة سردًا بصريًّا بطريقة إيحائية وجذابة ، تصنع منك محترفاً في المونتاج ",
    'levels' : [
      'مونتاج',
      'تأسيس تصميمي',
    ],
    "time" : "6-5 اشهر",
    "device" : "Core i5, i7 - 8G"
  },
  {
    "img" : "ui",
    "title" : "تصميم التطبيقات",
    "subTitle" : "تصميم واجهات التطبيقات",
    "dec" : "بعد إلمامك بقواعد وأساسيات التصميم الجرافيكي، يُمكنك هذا المسار من تصميم واجهات مستخدم احترافية لتطبيقات الهاتف، تسمح لك بالتميز وتحقيق الريادة في سوق العمل.",
    'levels' : [
      'Ui / Ux',
      'تأسيس تصميمي',
    ],
    "time" : "7-8 اشهر",
    "device" : "اي جهاز - 4GB"
  },
  {
    "img" : "flutter",
    "title" : "فلاتر",
    "subTitle" : "برمجة تطبيقات الموبايل",
    "dec" : "بعد إنهائك لمسار التأسيس البرمجي او كان لديك الاساس مسبقاً ستبدأ رحلتك في إحتراف تطوير التطبيقات لكلا المنصتين (Android/IOS) بلغة الدارت المستخدمة في بيئة التطوير Flutter",
    'levels' : [
      'فلاتر',
      'تأسيس برمجي',
    ],
    "time" : "4-3 اشهر",
    "device" : "Core i3 8100 - 4G"
  },
  {
    "img" : "web",
    "title" : "تطوير المواقع",
    "subTitle" : "Fullstack Web Development",
    "dec" : "بعد إنهائك لمسار التأسيس البرمجي أو لديك الأساس مسبقا ستبدأ رحلتك في احتراف تصميم وتطوير مواقع وتطبيقات الويب بالكامل back/front بأحدث اللغات والأدوات لبناء مواقع تفاعلية حصرية.",
    'levels' : [
      'ويب',
      'تأسيس برمجي',
    ],
    "time" : "7-6 اشهر",
    "device" : "اي حاسوب - 4GB"
  },
];